
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_storage_blob.b2c_main_css


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_main_css must be replaced
-/+ resource "azurerm_storage_blob" "b2c_main_css" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "2c32693834e83a99f4cb0ff2a39d207f" -> "c4a6798fa5139c853e393e704619dabf" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/main.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "main.css"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/main.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":732,"Program":"tfcmt","SHA1":"","Vars":{}} -->